app/controllers/articles_controller.rb

  def update
    @article.update(article_params)
---
UPDATE "articles" SET "body" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["body", "yet another body for a new article updated"], ["updated_at", "2016-05-17 19:07:58.006633"], ["id", 3]]