app/controllers/tags_controller.rb

DELETE FROM "taggings" WHERE "taggings"."id" = ?  [["id", 3]]
DELETE FROM "tags" WHERE "tags"."id" = ?  [["id", 1]]
---
  def destroy
    tag = @tag.name
    @tag.taggings.destroy_all

SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT 1  [["id", 3]]
---
  def set_tag
    @tag = Tag.find(params[:id])